# DBeam_GetObjAtFocus

## Description
Return the most recently created beam object

```pascal
FUNCTION DBeam_GetObjAtFocus : HANDLE;
```

```python
def vs.DBeam_GetObjAtFocus():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight